20260824/20260824/InformationRegisters/СБ_ВместимостьЯчеекПоТиповымУпаковкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СБ_ВместимостьЯчеекПоТиповымУпаковкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20260824/20260824/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

20260824/20260824/CommonModules/СкладыСервер/Ext/Module.bsl
&ИзменениеИКонтроль("РазместитьТоварВЯчейках")
Функция СБ_РазместитьТоварВЯчейках(МенеджерВременныхТаблиц, Склад, Помещение, РабочийУчасток, ЯчейкаИсточник, ОшибкаПроверки, ДополнятьМногооборотнойТарой)
	
	ПроверитьПодготовитьПараметрыНоменклатурыДляРазмещения(МенеджерВременныхТаблиц,Склад, Помещение, ЯчейкаИсточник, ОшибкаПроверки);
	
	Если ОшибкаПроверки Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультатов = Новый ТаблицаЗначений;
	ТаблицаРезультатов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезультатов.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаРезультатов.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));
	ТаблицаРезультатов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаРезультатов.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТаблицаРезультатов.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаРезультатов.Колонки.Добавить("КоличествоУпаковок", ОбщегоНазначенияУТ.ОписаниеТипаКоличественногоПоля(ДопустимыйЗнак.Неотрицательный));
	ТаблицаРезультатов.Колонки.Добавить("Количество", ОбщегоНазначенияУТ.ОписаниеТипаКоличественногоПоля(ДопустимыйЗнак.Неотрицательный));
	ТаблицаРезультатов.Колонки.Добавить("ВесУпаковки", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультатов.Колонки.Добавить("ОбъемУпаковки", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(18,6,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультатов.Колонки.Добавить("ПорядокОбхода", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаРезультатов.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(19,ДопустимаяДлина.Фиксированная)));
	ТаблицаРезультатов.Колонки.Добавить("РабочийУчасток", Новый ОписаниеТипов(Новый ОписаниеТипов("СправочникСсылка.РабочиеУчастки")));
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОшибок.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаОшибок.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаОшибок.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаОшибок.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Любой)));
	ТаблицаОшибок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Любой)));
	ТаблицаОшибок.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	
	ТаблицаНаполненияЯчеек = Новый ТаблицаЗначений;
	ТаблицаНаполненияЯчеек.Колонки.Добавить("КоличествоСерий", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаНаполненияЯчеек.Колонки.Добавить("КоличествоХарактеристик", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаНаполненияЯчеек.Колонки.Добавить("КоличествоНоменклатур", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаНаполненияЯчеек.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));
	ТаблицаНаполненияЯчеек.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТаблицаНаполненияЯчеек.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаНаполненияЯчеек.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)));
	
	ТаблицаНаполненияЯчеек.Индексы.Добавить("Ячейка");
	
	ТаблицаРазмещенныхТоваров = Новый ТаблицаЗначений;
	ТаблицаРазмещенныхТоваров.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));	
	ТаблицаРазмещенныхТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	
	ТаблицаРазмещенныхТоваров.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
	ТаблицаРазмещенныхТоваров.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));	
	
	МассивУчастков = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Упаковка КАК Упаковка,
	|	Таблица.Серия КАК Серия,
	|	Таблица.УчетСерийПоFEFO КАК УчетСерийПоFEFO,
	|	Таблица.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Назначение КАК Назначение,
	|	Таблица.ФизическиРазличаетсяОтНазначения,
	|	Таблица.ОграничиватьПоВесу,
	|	Таблица.ОграничиватьПоОбъему,
	|	Таблица.Высота КАК Высота,
	|	Таблица.Ширина КАК Ширина,
	|	Таблица.Глубина КАК Глубина,
	|	Таблица.Объем КАК Объем,
	|	Таблица.Безразмерная КАК Безразмерная,
	|	Таблица.Вес КАК Вес,
	|	Таблица.ГоденДо КАК ГоденДо,
	|	Таблица.СкладскаяГруппаНоменклатуры КАК СкладскаяГруппаНоменклатуры,
	|	Таблица.СкладскаяГруппаУпаковок КАК СкладскаяГруппаУпаковок,
	|	Таблица.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ИЗ
	|	ТаблицаНоменклатурыРасширенная КАК Таблица
	|
	|УПОРЯДОЧИТЬ ПО
	|   УчетСерийПоFEFO,
	|	Номенклатура.Наименование,
	|	Характеристика.Наименование,
	|	ГоденДо,
	|	Упаковка.Наименование
	|
	|ИТОГИ ПО
	|	Назначение,
	|	Номенклатура,
	|	Упаковка,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаРазмещенияТоваровВЯчейках.ОбластьХранения КАК ОбластьХранения,
	|	ТаблицаНоменклатуры.СкладскаяГруппаНоменклатуры КАК СкладскаяГруппаНоменклатуры,
	|	ТаблицаНоменклатуры.СкладскаяГруппаУпаковок КАК СкладскаяГруппаУпаковок,
	|	ВЫБОР  
	|		КОГДА ПравилаРазмещенияТоваровВЯчейках.ОбластьХранения.ОбластьОбособленногоХранения ТОГДА
	|			ПравилаРазмещенияТоваровВЯчейках.Приоритет
	|		ИНАЧЕ 
	|			ПравилаРазмещенияТоваровВЯчейках.Приоритет + 1000
	|	КОНЕЦ КАК ПриоритетОбласти,
	|	ПравилаРазмещенияТоваровВЯчейках.ОбластьХранения.ОбластьОбособленногоХранения КАК ОбластьОбособленногоХранения,
	|	ТаблицаНоменклатуры.ФизическиРазличаетсяОтНазначения КАК ФизическиРазличаетсяОтНазначения
	|ПОМЕСТИТЬ ОбластиХраненияСкладскихГрупп
	|ИЗ
	|	ТаблицаНоменклатурыРасширенная КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаРазмещенияТоваровВЯчейках КАК ПравилаРазмещенияТоваровВЯчейках
	|		ПО ТаблицаНоменклатуры.СкладскаяГруппаНоменклатуры = ПравилаРазмещенияТоваровВЯчейках.СкладскаяГруппаНоменклатуры
	|					И ТаблицаНоменклатуры.СкладскаяГруппаУпаковок = ПравилаРазмещенияТоваровВЯчейках.СкладскаяГруппаУпаковок
	|ГДЕ
	|	ПравилаРазмещенияТоваровВЯчейках.Склад = &Склад
	|	И ПравилаРазмещенияТоваровВЯчейках.Помещение = &Помещение
	// Если товар размещается не под назначение, тогда доступны только области хранения не обособленного хранения. 
	|	И (ВЫБОР КОГДА ТаблицаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА
	|				НЕ ПравилаРазмещенияТоваровВЯчейках.ОбластьХранения.ОбластьОбособленногоХранения
	|		ИНАЧЕ ВЫБОР КОГДА ТаблицаНоменклатуры.ФизическиРазличаетсяОтНазначения ТОГДА
	|					ИСТИНА
	|			 ИНАЧЕ ПравилаРазмещенияТоваровВЯчейках.ОбластьХранения.ОбластьОбособленногоХранения
	|			 КОНЕЦ
	|	КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрЯчейки.Ссылка КАК Ячейка,
	|	ОбластиХраненияСкладскихГрупп.СкладскаяГруппаНоменклатуры КАК СкладскаяГруппаНоменклатуры,
	|	ОбластиХраненияСкладскихГрупп.СкладскаяГруппаУпаковок КАК СкладскаяГруппаУпаковок,
	|	МИНИМУМ(ОбластиХраненияСкладскихГрупп.ПриоритетОбласти) КАК ПриоритетОбласти,
	|	МИНИМУМ(ОбластиХраненияСкладскихГрупп.ОбластьОбособленногоХранения) КАК ОбластьОбособленногоХранения,
	|	МИНИМУМ(ОбластиХраненияСкладскихГрупп.ФизическиРазличаетсяОтНазначения) КАК ФизическиРазличаетсяОтНазначения
	|ПОМЕСТИТЬ ТаблицаЯчеекДляЗапроса
	|ИЗ
	|	ОбластиХраненияСкладскихГрупп КАК ОбластиХраненияСкладскихГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК СпрЯчейки
	|		ПО (СпрЯчейки.ОбластьХранения = ОбластиХраненияСкладскихГрупп.ОбластьХранения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БлокировкиСкладскихЯчеек КАК БлокировкиЯчеек
	|		ПО (СпрЯчейки.Ссылка = БлокировкиЯчеек.Ячейка)
	|			И (БлокировкиЯчеек.ТипБлокировки = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировокСкладскихЯчеек.Полная)
	|				ИЛИ БлокировкиЯчеек.ТипБлокировки = ЗНАЧЕНИЕ(Перечисление.ТипыБлокировокСкладскихЯчеек.Размещение))
	|ГДЕ
	|	БлокировкиЯчеек.ТипБлокировки ЕСТЬ NULL 
	|	И СпрЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Хранение)
	|	И (НЕ СпрЯчейки.ЭтоГруппа)
	|	И (НЕ СпрЯчейки.ПометкаУдаления)
	|	И (СпрЯчейки.Владелец = &Склад)
	|	И (СпрЯчейки.Помещение = &Помещение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрЯчейки.Ссылка,
	|	ОбластиХраненияСкладскихГрупп.СкладскаяГруппаНоменклатуры,
	|	ОбластиХраненияСкладскихГрупп.СкладскаяГруппаУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	СУММА((ТоварыВЯчейкахОстатки.ВНаличииОстаток + ТоварыВЯчейкахОстатки.КРазмещениюОстаток) * &ТекстЗапросаОбъемУпаковки) КАК ЗанятыйОбъем,
	|	СУММА((ТоварыВЯчейкахОстатки.ВНаличииОстаток + ТоварыВЯчейкахОстатки.КРазмещениюОстаток) * &ТекстЗапросаВесУпаковки) КАК ЗанятыйВес
	|ПОМЕСТИТЬ ЗапросПоЗанятомуОбъемуВесу
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка В
	|				(ВЫБРАТЬ
	|					ТаблицаЯчеекДляЗапроса.Ячейка
	|				ИЗ
	|					ТаблицаЯчеекДляЗапроса КАК ТаблицаЯчеекДляЗапроса)) КАК ТоварыВЯчейкахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЯчеекДляЗапроса.Ячейка КАК Ячейка,
	|	ТаблицаЯчеекДляЗапроса.СкладскаяГруппаНоменклатуры КАК СкладскаяГруппаНоменклатуры,
	|	ТаблицаЯчеекДляЗапроса.СкладскаяГруппаУпаковок КАК СкладскаяГруппаУпаковок,
	|	ТаблицаЯчеекДляЗапроса.ПриоритетОбласти КАК ПриоритетОбласти,
	|	ТаблицаЯчеекДляЗапроса.ОбластьОбособленногоХранения КАК ОбластьОбособленногоХранения,
	|	ТаблицаЯчеекДляЗапроса.ФизическиРазличаетсяОтНазначения КАК ФизическиРазличаетсяОтНазначения,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.УровеньДоступности КАК УровеньДоступности,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ПорядокОбхода КАК ПорядокОбхода,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.РабочийУчасток КАК РабочийУчасток,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Код КАК Код,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Объем * (ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ОбъемЕдиницаИзмерения.Числитель/ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ОбъемЕдиницаИзмерения.Знаменатель) * ТаблицаЯчеекДляЗапроса.Ячейка.МаксимальныйКоэффициентНаполненностиПоОбъему / 100 - ЕСТЬNULL(ЗапросПоЗанятомуОбъемуВесу.ЗанятыйОбъем, 0) КАК СвободныйОбъем,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Грузоподъемность * (ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ВесЕдиницаИзмерения.Числитель/ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ВесЕдиницаИзмерения.Знаменатель) * ТаблицаЯчеекДляЗапроса.Ячейка.МаксимальныйКоэффициентНаполненностиПоВесу / 100 - ЕСТЬNULL(ЗапросПоЗанятомуОбъемуВесу.ЗанятыйВес, 0) КАК СвободныйВес,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Ширина*ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ШиринаЕдиницаИзмерения.Числитель/ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ШиринаЕдиницаИзмерения.Знаменатель КАК Ширина,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Глубина*ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ГлубинаЕдиницаИзмерения.Числитель/ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ГлубинаЕдиницаИзмерения.Знаменатель КАК Глубина,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Высота*ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ВысотаЕдиницаИзмерения.Числитель/ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.ВысотаЕдиницаИзмерения.Знаменатель КАК Высота,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.НеОграниченаПоГрузоподъемности КАК НеОграниченаПоГрузоподъемности,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.НеОграниченаПоРазмерам КАК НеОграниченаПоРазмерам,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ОбластьХранения.ПриоритетРазмещенияВСвободныеЯчейки КАК ПриоритетРазмещенияВСвободныеЯчейки,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ОбластьХранения.ПриоритетРазмещенияВМонотоварныеЯчейки КАК ПриоритетРазмещенияВМонотоварныеЯчейки,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ОбластьХранения.ПриоритетРазмещенияВСмешанныеЯчейки КАК ПриоритетРазмещенияВСмешанныеЯчейки,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ОбластьХранения.ПриоритетРазмещенияВЯчейкиСДругимТоваром КАК ПриоритетРазмещенияВЯчейкиСДругимТоваром,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ОбластьХранения.ОписаниеМонотоварности КАК ОписаниеМонотоварности,
	|	ТаблицаЯчеекДляЗапроса.Ячейка.ОбластьХранения.СтрогаяМонотоварность КАК СтрогаяМонотоварность,
	|	СостоянияПересчетовЯчеек.Состояние КАК СостояниеПересчета 
	|ПОМЕСТИТЬ ТаблицаЯчеек
	|ИЗ
	|	ТаблицаЯчеекДляЗапроса КАК ТаблицаЯчеекДляЗапроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапросПоЗанятомуОбъемуВесу КАК ЗапросПоЗанятомуОбъемуВесу
	|		ПО ТаблицаЯчеекДляЗапроса.Ячейка = ЗапросПоЗанятомуОбъемуВесу.Ячейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПересчетовЯчеек КАК СостоянияПересчетовЯчеек
	|		ПО ТаблицаЯчеекДляЗапроса.Ячейка = СостоянияПересчетовЯчеек.Ячейка
	|			И (СостоянияПересчетовЯчеек.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияПересчетовЯчеек.ТребуетсяПересчет))
	|ГДЕ
	|	(ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Объем * ТаблицаЯчеекДляЗапроса.Ячейка.МаксимальныйКоэффициентНаполненностиПоОбъему / 100 - ЕСТЬNULL(ЗапросПоЗанятомуОбъемуВесу.ЗанятыйОбъем, 0) > 0
	|			ИЛИ ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.НеОграниченаПоРазмерам)
	|	И (ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.Грузоподъемность * ТаблицаЯчеекДляЗапроса.Ячейка.МаксимальныйКоэффициентНаполненностиПоВесу / 100 - ЕСТЬNULL(ЗапросПоЗанятомуОбъемуВесу.ЗанятыйВес, 0) > 0
	|			ИЛИ ТаблицаЯчеекДляЗапроса.Ячейка.Типоразмер.НеОграниченаПоГрузоподъемности)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ячейка,
	|	СкладскаяГруппаНоменклатуры,
	|	СкладскаяГруппаУпаковок,
	|	НеОграниченаПоГрузоподъемности,
	|	НеОграниченаПоРазмерам,
	|	ОбластьОбособленногоХранения,
	|	ФизическиРазличаетсяОтНазначения,
	|	Ширина,
	|	Глубина,
	|	Высота,
	|	СвободныйОбъем,
	|	СвободныйВес,
	|	ПриоритетОбласти,
	|	СостояниеПересчета,
	|	РабочийУчасток,
	|	УровеньДоступности,
	|	ПорядокОбхода,
	|	СтрогаяМонотоварность,
	|	ОписаниеМонотоварности,
	|	Код,
	|	ПриоритетРазмещенияВЯчейкиСДругимТоваром,
	|	ПриоритетРазмещенияВСмешанныеЯчейки,
	|	ПриоритетРазмещенияВСвободныеЯчейки,
	|	ПриоритетРазмещенияВМонотоварныеЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Назначение КАК Назначение,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ ТоварыВЯчейкахОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка В
	|				(ВЫБРАТЬ
	|					ТаблицаЯчеек.Ячейка
	|				ИЗ
	|					ТаблицаЯчеек КАК ТаблицаЯчеек)) КАК ТоварыВЯчейкахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ячейка,
	|	Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ТоварыВЯчейкахОстатки.Серия.ГоденДо) КАК ГоденДо,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ МаксимальныеСрокиГодностиВЯчейках
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			(Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ТаблицаНоменклатуры.Номенклатура,
	|						ТаблицаНоменклатуры.Характеристика
	|					ИЗ
	|						ТаблицаНоменклатурыРасширенная КАК ТаблицаНоменклатуры
	|					ГДЕ
	|						ТаблицаНоменклатуры.УчетСерийПоFEFO)
	|				И Ячейка В
	|					(ВЫБРАТЬ
	|						ТаблицаЯчеек.Ячейка
	|					ИЗ
	|						ТаблицаЯчеек КАК ТаблицаЯчеек)) КАК ТоварыВЯчейкахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Ячейка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Ячейка,
	|	ГоденДо
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаЯчеекДляЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбластиХраненияСкладскихГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗапросПоЗанятомуОбъемуВесу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка) КАК Ячейка,
	|	0 КАК Объем,
	|	0 КАК Вес,
	|	0 КАК КоличествоНоменклатур,
	|	0 КАК КоличествоХарактеристик,
	|	0 КАК КоличествоСерий,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ПОМЕСТИТЬ ТаблицаНаполненияЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка) КАК Ячейка,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия
	|ПОМЕСТИТЬ ТаблицаРазмещенныхТоваров";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("ТоварыВЯчейкахОстатки.Упаковка", "ТоварыВЯчейкахОстатки.Номенклатура", Ложь));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", 
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("ТоварыВЯчейкахОстатки.Упаковка", "ТоварыВЯчейкахОстатки.Номенклатура", Ложь));
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Помещение",Помещение); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Результат = МассивРезультатов[0]; // РезультатЗапроса
	
	ВыборкаПоНазначению = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоНазначению.Следующий() Цикл
		
		ВыборкаПоНоменклатуре = ВыборкаПоНазначению.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоНоменклатуре.Следующий() Цикл
			
			ВыборкаПоУпаковкам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоУпаковкам.Следующий() Цикл
				
				ВыборкаПоХарактеристикам = ВыборкаПоУпаковкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоХарактеристикам.Следующий() Цикл
					
					ВыборкаПоСериям = ВыборкаПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоСериям.Следующий() Цикл
						
						КоличествоУпаковок = ВыборкаПоСериям.КоличествоУпаковок;
						
						СтруктураТаблицАлгоритмаРазмещенияТоваров = СтруктураТаблицАлгоритмаРазмещенияТоваров();
						СтруктураТаблицАлгоритмаРазмещенияТоваров.ТаблицаРезультатов = ТаблицаРезультатов;
						СтруктураТаблицАлгоритмаРазмещенияТоваров.ТаблицаОшибок = ТаблицаОшибок;
						СтруктураТаблицАлгоритмаРазмещенияТоваров.ТаблицаНаполненияЯчеек = ТаблицаНаполненияЯчеек;
						СтруктураТаблицАлгоритмаРазмещенияТоваров.ТаблицаРазмещенныхТоваров = ТаблицаРазмещенныхТоваров;
						
						РазместитьПозициюТовара(МенеджерВременныхТаблиц, СтруктураТаблицАлгоритмаРазмещенияТоваров, ВыборкаПоСериям, МассивУчастков, КоличествоУпаковок);
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Отобрать товары по рабочему участку
	Если ЗначениеЗаполнено(РабочийУчасток) Тогда
		ОтборПоРабочемуУчастку = Новый Структура("РабочийУчасток",РабочийУчасток);
		ТаблицаРезультатов = ТаблицаРезультатов.Скопировать(ОтборПоРабочемуУчастку);
	КонецЕсли;
	
	Если ДополнятьМногооборотнойТарой Тогда
		ДополнитьМногооборотнойТаройТаблицуРазмещения(ТаблицаРезультатов);
	КонецЕсли;
	
	// Дополнение тарой таблицы ошибок для баланса тары убранной при проверке.
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаОшибок.Номенклатура,
	|	ТаблицаОшибок.Характеристика,
	|	ТаблицаОшибок.Назначение,
	|	ТаблицаОшибок.Серия,
	|	ВЫРАЗИТЬ(ТаблицаОшибок.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	|	ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка) КАК Справочник.СкладскиеЯчейки) КАК Ячейка,
	|	ТаблицаОшибок.КоличествоУпаковок,
	|	ТаблицаОшибок.Количество
	|ПОМЕСТИТЬ ТаблицаОшибок
	|ИЗ
	|	&ТаблицаОшибок КАК ТаблицаОшибок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОшибок.Номенклатура,
	|	ТаблицаОшибок.Характеристика,
	|	ТаблицаОшибок.Назначение,
	|	ТаблицаОшибок.Серия,
	|	ТаблицаОшибок.Упаковка,
	|	ТаблицаОшибок.Ячейка,
	|	ТаблицаОшибок.КоличествоУпаковок,
	|	ТаблицаОшибок.Количество,
	|	&ТекстЗапросаВесУпаковки КАК ВесУпаковки,
	|	&ТекстЗапросаОбъемУпаковки КАК ОбъемУпаковки,
	|	ТаблицаОшибок.Ячейка.ПорядокОбхода КАК ПорядокОбхода,
	|	ТаблицаОшибок.Ячейка.Код КАК Код,
	|	ТаблицаОшибок.Ячейка.РабочийУчасток КАК РабочийУчасток
	|ИЗ
	|	ТаблицаОшибок КАК ТаблицаОшибок";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("ТаблицаОшибок.Упаковка", "ТаблицаОшибок.Номенклатура", Ложь));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("ТаблицаОшибок.Упаковка", "ТаблицаОшибок.Номенклатура", Ложь));
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТаблицаОшибок",ТаблицаОшибок);
	ТаблицаОшибок = Запрос.Выполнить().Выгрузить();
	
	Если ДополнятьМногооборотнойТарой Тогда
		ДополнитьМногооборотнойТаройТаблицуРазмещения(ТаблицаОшибок);
	КонецЕсли;
	
	ТаблицаРезультатов.Сортировать("ПорядокОбхода,Код");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТаблицаРезультатов",ТаблицаРезультатов);
	СтруктураВозврата.Вставить("ТаблицаОшибок",ТаблицаОшибок);
	СтруктураВозврата.Вставить("МассивУчастков",МассивУчастков);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&ИзменениеИКонтроль("РазместитьПозициюТовара")  
Процедура СБ_РазместитьПозициюТовара(МенеджерВременныхТаблиц, СтруктураТаблиц, ВыборкаПоСериям, МассивУчастков, КоличествоУпаковок) 
	
	ПоFEFO = ВыборкаПоСериям.УчетСерийПоFEFO;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстПриоритетСтратегии =
	"ВЫБОР	
	|	КОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) <> &Назначение И ПулЯчеек.ОбластьОбособленногоХранения		 
	|		ТОГДА ВЫБОР
	|				КОГДА ОстаткиВЯчейках.Ячейка ЕСТЬ NULL
	|					ТОГДА 1 			
	|			 	ИНАЧЕ ВЫБОР
	|						КОГДА ОстаткиВЯчейках.ЕстьНужноеНазначение
	|							ТОГДА 0
	|						ИНАЧЕ &НарушенаМонотоварность
	|					  КОНЕЦ
	|			  КОНЕЦ			
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ОстаткиВЯчейках.Ячейка ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|							ТОГДА 1
	|						ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВСвободныеЯчейки
	|					  КОНЕЦ
	|			ИНАЧЕ ВЫБОР		 
	|					КОГДА ПулЯчеек.ОписаниеМонотоварности = ЗНАЧЕНИЕ(Перечисление.ОписаниеМонотоварности.ПоНоменклатуре)
	|						ТОГДА ВЫБОР
	|								КОГДА ОстаткиВЯчейках.ЕстьНужнаяНоменклатура
	|										И ОстаткиВЯчейках.КоличествоРазныхНоменклатурВЯчейке = 1 
	|										И ОстаткиВЯчейках.КоличествоНоменклатур <= 1
	|									ТОГДА ВЫБОР
	|											КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|												ТОГДА 0
	|       	                           		ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВМонотоварныеЯчейки
	|									  	  КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|											ТОГДА &НарушенаМонотоварность
	|           	                        ИНАЧЕ ВЫБОР									
	|											  	КОГДА ОстаткиВЯчейках.ЕстьНужнаяНоменклатура
	|													ТОГДА ПулЯчеек.ПриоритетРазмещенияВСмешанныеЯчейки
	|												ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВЯчейкиСДругимТоваром
	|									 		  КОНЕЦ
	|									  КОНЕЦ				
	|							   КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПулЯчеек.ОписаниеМонотоварности = ЗНАЧЕНИЕ(Перечисление.ОписаниеМонотоварности.ПоХарактеристике)
	|								ТОГДА
	|									ВЫБОР
	|										КОГДА ОстаткиВЯчейках.ЕстьНужнаяНоменклатураИХарактеристика
	|												И ОстаткиВЯчейках.КоличествоРазныхНоменклатурВЯчейке = 1
	|												И ОстаткиВЯчейках.КоличествоНоменклатур <= 1
	|												И ОстаткиВЯчейках.КоличествоРазныхХарактеристикВЯчейке = 1
	|												И ОстаткиВЯчейках.КоличествоХарактеристик <= 1
	|											ТОГДА ВЫБОР
	|													КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|														ТОГДА 0
	|           	                       				ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВМонотоварныеЯчейки
	|									  	 		  КОНЕЦ
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|													ТОГДА &НарушенаМонотоварность
	|                              			     	ИНАЧЕ ВЫБОР									
	|													  	КОГДА ОстаткиВЯчейках.ЕстьНужнаяНоменклатураИХарактеристика
	|															ТОГДА ПулЯчеек.ПриоритетРазмещенияВСмешанныеЯчейки
	|														ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВЯчейкиСДругимТоваром
	|									 				  КОНЕЦ
	|											  КОНЕЦ				
	|									КОНЕЦ
	|								ИНАЧЕ
	|									ВЫБОР
	|										КОГДА ОстаткиВЯчейках.ЕстьНужнаяНоменклатураИХарактеристикаИСерия
	|												И ОстаткиВЯчейках.КоличествоРазныхНоменклатурВЯчейке = 1
	|												И ОстаткиВЯчейках.КоличествоНоменклатур <= 1
	|												И ОстаткиВЯчейках.КоличествоРазныхХарактеристикВЯчейке = 1
	|												И ОстаткиВЯчейках.КоличествоХарактеристик <= 1
	|												И ОстаткиВЯчейках.КоличествоРазныхСерийВЯчейке = 1
	|												И ОстаткиВЯчейках.КоличествоСерий <= 1
	|											ТОГДА ВЫБОР
	|													КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|														ТОГДА 0
	|                   	               				ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВМонотоварныеЯчейки
	|									  	 		  КОНЕЦ
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПулЯчеек.СтрогаяМонотоварность 
	|													ТОГДА &НарушенаМонотоварность
	| 	                             		     	ИНАЧЕ ВЫБОР									
	|													  	КОГДА ОстаткиВЯчейках.ЕстьНужнаяНоменклатураИХарактеристикаИСерия
	|															ТОГДА ПулЯчеек.ПриоритетРазмещенияВСмешанныеЯчейки
	|														ИНАЧЕ ПулЯчеек.ПриоритетРазмещенияВЯчейкиСДругимТоваром
	|									 				  КОНЕЦ
	|											  КОНЕЦ				
	|									КОНЕЦ
	|						КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|КОНЕЦ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаЯчеек.Ячейка КАК Ячейка,
	|	ТаблицаЯчеек.СвободныйОбъем - ЕСТЬNULL(ТаблицаНаполненияЯчеек.Объем, 0) КАК СвободныйОбъем,
	|	ТаблицаЯчеек.СвободныйВес - ЕСТЬNULL(ТаблицаНаполненияЯчеек.Вес, 0) КАК СвободныйВес,
	|	ТаблицаЯчеек.НеОграниченаПоГрузоподъемности КАК НеОграниченаПоГрузоподъемности,
	|	ТаблицаЯчеек.НеОграниченаПоРазмерам КАК НеОграниченаПоРазмерам,
	|	ТаблицаЯчеек.ПорядокОбхода КАК ПорядокОбхода,
	|	ТаблицаЯчеек.РабочийУчасток КАК РабочийУчасток,                                         
	|	ТаблицаЯчеек.ПриоритетОбласти КАК ПриоритетОбласти,
	|	ТаблицаЯчеек.ОбластьОбособленногоХранения КАК ОбластьОбособленногоХранения,
	|	ТаблицаЯчеек.ПриоритетРазмещенияВСвободныеЯчейки КАК ПриоритетРазмещенияВСвободныеЯчейки,
	|	ТаблицаЯчеек.ПриоритетРазмещенияВМонотоварныеЯчейки КАК ПриоритетРазмещенияВМонотоварныеЯчейки,
	|	ТаблицаЯчеек.ПриоритетРазмещенияВСмешанныеЯчейки КАК ПриоритетРазмещенияВСмешанныеЯчейки,
	|	ТаблицаЯчеек.ПриоритетРазмещенияВЯчейкиСДругимТоваром КАК ПриоритетРазмещенияВЯчейкиСДругимТоваром,
	|	ТаблицаЯчеек.УровеньДоступности КАК УровеньДоступности,
	|	ТаблицаЯчеек.Код КАК Код,   
	|	ТаблицаЯчеек.СостояниеПересчета КАК СостояниеПересчета,
	|	ТаблицаЯчеек.ОписаниеМонотоварности КАК ОписаниеМонотоварности,   
	|	ТаблицаЯчеек.СтрогаяМонотоварность КАК СтрогаяМонотоварность
	|ПОМЕСТИТЬ ПулЯчеек
	|ИЗ
	|	ТаблицаЯчеек КАК ТаблицаЯчеек
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНаполненияЯчеек КАК ТаблицаНаполненияЯчеек
	|		ПО ТаблицаЯчеек.Ячейка = ТаблицаНаполненияЯчеек.Ячейка
	|ГДЕ
	|	ТаблицаЯчеек.СкладскаяГруппаНоменклатуры = &СкладскаяГруппаНоменклатуры
	|	И ТаблицаЯчеек.СкладскаяГруппаУпаковок = &СкладскаяГруппаУпаковок
	// Для размещения товаров под назначения доступны все ячейки из области обособленного хранения и ячейки из области
	// обычного хранения, но только для товаров у которых свойство ФизическиРазличаетсяОтНазначения = Истина.
	| 	И (ВЫБОР
	|		КОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = &Назначение 
	|			ТОГДА НЕ ТаблицаЯчеек.ОбластьОбособленногоХранения
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ТаблицаЯчеек.ОбластьОбособленногоХранения  
	|					ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаЯчеек.ФизическиРазличаетсяОтНазначения
	|			КОНЕЦ
	|		КОНЕЦ)				
	|	И (ТаблицаЯчеек.НеОграниченаПоРазмерам
	|			ИЛИ НЕ &ОграничиватьПоОбъему
	|			ИЛИ ТаблицаЯчеек.Ширина >= &Ширина
	|				И ТаблицаЯчеек.Глубина >= &Глубина
	|				И ТаблицаЯчеек.Высота >= &Высота
	|				И ТаблицаЯчеек.СвободныйОбъем - ЕСТЬNULL(ТаблицаНаполненияЯчеек.Объем, 0) >= &Объем)
	|	И (ТаблицаЯчеек.НеОграниченаПоГрузоподъемности
	|			ИЛИ НЕ &ОграничиватьПоВесу
	|			ИЛИ ТаблицаЯчеек.СвободныйВес - ЕСТЬNULL(ТаблицаНаполненияЯчеек.Вес, 0) >= &Вес)
	|	И ВЫБОР
	|			КОГДА &Безразмерная
	|				ТОГДА ТаблицаЯчеек.НеОграниченаПоРазмерам
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстаткиСРезультатами.Ячейка КАК Ячейка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТоварыВЯчейкахОстаткиСРезультатами.Номенклатура = &Номенклатура
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьНужнаяНоменклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТоварыВЯчейкахОстаткиСРезультатами.Характеристика = &Характеристика
	|					И ТоварыВЯчейкахОстаткиСРезультатами.Номенклатура = &Номенклатура
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьНужнаяНоменклатураИХарактеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТоварыВЯчейкахОстаткиСРезультатами.Характеристика = &Характеристика
	|					И ТоварыВЯчейкахОстаткиСРезультатами.Номенклатура = &Номенклатура
	|					И ТоварыВЯчейкахОстаткиСРезультатами.Серия = &Серия
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьНужнаяНоменклатураИХарактеристикаИСерия,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВЯчейкахОстаткиСРезультатами.Номенклатура) КАК КоличествоРазныхНоменклатурВЯчейке,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВЯчейкахОстаткиСРезультатами.Характеристика) КАК КоличествоРазныхХарактеристикВЯчейке,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыВЯчейкахОстаткиСРезультатами.Серия) КАК КоличествоРазныхСерийВЯчейке,
	|	МИНИМУМ(ТоварыВЯчейкахОстаткиСРезультатами.НоваяНоменклатура) КАК НоваяНоменклатура,
	|	МИНИМУМ(ТоварыВЯчейкахОстаткиСРезультатами.НоваяНоменклатураИЛИХарактеристика) КАК НоваяНоменклатураИЛИХарактеристика,
	|	МИНИМУМ(ТоварыВЯчейкахОстаткиСРезультатами.НоваяНоменклатураИЛИХарактеристика) КАК НоваяНоменклатураИЛИХарактеристикаИЛИСерия,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТоварыВЯчейкахОстаткиСРезультатами.Назначение = &Назначение
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьНужноеНазначение,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА ТоварыВЯчейкахОстаткиСРезультатами.ОбластьОбособленногоХранения
	|				ТОГДА ВЫБОР
	|						КОГДА ТоварыВЯчейкахОстаткиСРезультатами.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|							И ТоварыВЯчейкахОстаткиСРезультатами.Назначение <> &Назначение
	|						ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					  КОНЕЦ	
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) КАК ЯчейкаПодДругоеНазначение
	|ПОМЕСТИТЬ ОстаткиВЯчейкахБезКоличества
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|		ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|		ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|		ИСТИНА КАК НоваяНоменклатура,
	|		ИСТИНА КАК НоваяНоменклатураИЛИХарактеристика,
	|		ИСТИНА КАК НоваяНоменклатураИЛИХарактеристикаИЛИСерия,
	// Не учитываю назначение в ячейках необособленного хранения. Там этот признак ни на что не влияет.
	|		ВЫБОР
	|			КОГДА ПулЯчеек.ОбластьОбособленногоХранения
	|				ТОГДА ТоварыВЯчейкахОстатки.Назначение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		КОНЕЦ КАК Назначение,
	|		ПулЯчеек.ОбластьОбособленногоХранения КАК ОбластьОбособленногоХранения
	|	ИЗ
	|		ПулЯчеек КАК ПулЯчеек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыВЯчейкахОстатки КАК ТоварыВЯчейкахОстатки
	|			ПО ПулЯчеек.Ячейка = ТоварыВЯчейкахОстатки.Ячейка
	|	ГДЕ
	|		ТоварыВЯчейкахОстатки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаНаполненияЯчеек.Ячейка,
	|		ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|		ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)),
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> &Номенклатура
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> &Номенклатура
	|					ИЛИ ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) <> &Характеристика
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> &Номенклатура
	|					ИЛИ ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) <> &Характеристика
	|					ИЛИ ЕСТЬNULL(ТаблицаРазмещенныхТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) <> &Серия
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) <> &Назначение И ПулЯчеек.ОбластьОбособленногоХранения
	|				ТОГДА ТаблицаНаполненияЯчеек.Назначение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		КОНЕЦ КАК Назначение,
	|		ПулЯчеек.ОбластьОбособленногоХранения  
	|	ИЗ
	|		ТаблицаНаполненияЯчеек КАК ТаблицаНаполненияЯчеек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПулЯчеек КАК ПулЯчеек
	|			ПО (ПулЯчеек.Ячейка = ТаблицаНаполненияЯчеек.Ячейка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазмещенныхТоваров КАК ТаблицаРазмещенныхТоваров
	|			ПО (ТаблицаРазмещенныхТоваров.Ячейка = ТаблицаНаполненияЯчеек.Ячейка)) КАК ТоварыВЯчейкахОстаткиСРезультатами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстаткиСРезультатами.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиВЯчейкахБезКоличества.Ячейка,
	|	ОстаткиВЯчейкахБезКоличества.ЕстьНужнаяНоменклатура,
	|	ОстаткиВЯчейкахБезКоличества.ЕстьНужнаяНоменклатураИХарактеристика,
	|	ОстаткиВЯчейкахБезКоличества.ЕстьНужнаяНоменклатураИХарактеристикаИСерия,
	|	ОстаткиВЯчейкахБезКоличества.КоличествоРазныхНоменклатурВЯчейке,
	|	ОстаткиВЯчейкахБезКоличества.КоличествоРазныхХарактеристикВЯчейке,
	|	ОстаткиВЯчейкахБезКоличества.КоличествоРазныхСерийВЯчейке,
	|	ЕСТЬNULL(ТаблицаНаполненияЯчеек.КоличествоНоменклатур,0) КАК КоличествоНоменклатур,
	|	ЕСТЬNULL(ТаблицаНаполненияЯчеек.КоличествоХарактеристик,0) КАК КоличествоХарактеристик,
	|	ЕСТЬNULL(ТаблицаНаполненияЯчеек.КоличествоСерий,0) КАК КоличествоСерий,
	|	ОстаткиВЯчейкахБезКоличества.НоваяНоменклатура,
	|	ОстаткиВЯчейкахБезКоличества.НоваяНоменклатураИЛИХарактеристика,
	|	ОстаткиВЯчейкахБезКоличества.НоваяНоменклатураИЛИХарактеристикаИЛИСерия,
	|	ОстаткиВЯчейкахБезКоличества.ЕстьНужноеНазначение,
	|	ОстаткиВЯчейкахБезКоличества.ЯчейкаПодДругоеНазначение 
	|ПОМЕСТИТЬ ОстаткиВЯчейках
	|ИЗ
	|	ОстаткиВЯчейкахБезКоличества КАК ОстаткиВЯчейкахБезКоличества
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНаполненияЯчеек КАК ТаблицаНаполненияЯчеек
	|		ПО ОстаткиВЯчейкахБезКоличества.Ячейка = ТаблицаНаполненияЯчеек.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// т.к. в каждую ячейку гарантированно можно разместить
	// хотя бы одну упаковку, то достаточно выбрать количество
	// ячеек равное количеству упаковок.
	|ВЫБРАТЬ &ТекстЗапросаВыбратьПервые,
	|	ПулЯчеек.Ячейка КАК Ячейка,
	|	ПулЯчеек.Код КАК Код,
	|	ПулЯчеек.СвободныйОбъем,
	|	ВЫБОР
	|		КОГДА ПулЯчеек.ОбластьОбособленногоХранения
	|			ТОГДА -ПулЯчеек.СвободныйОбъем
	|		ИНАЧЕ ПулЯчеек.СвободныйОбъем
	|	КОНЕЦ СвободныйОбъемПорядок,
	|	ПулЯчеек.СвободныйВес,
	|	ПулЯчеек.ОбластьОбособленногоХранения,
	|	ПулЯчеек.ПриоритетОбласти,
	|	ПулЯчеек.НеОграниченаПоГрузоподъемности,
	|	ПулЯчеек.НеОграниченаПоРазмерам,
	|	ПулЯчеек.ПорядокОбхода КАК ПорядокОбхода,
	|	ПулЯчеек.РабочийУчасток КАК РабочийУчасток,
	|	ПулЯчеек.УровеньДоступности КАК УровеньДоступности,
	|	ЕСТЬNULL(ОстаткиВЯчейках.НоваяНоменклатура, ИСТИНА) КАК НоваяНоменклатура,
	|	ЕСТЬNULL(ОстаткиВЯчейках.НоваяНоменклатураИЛИХарактеристика, ИСТИНА) КАК НоваяНоменклатураИЛИХарактеристика,
	|	ЕСТЬNULL(ОстаткиВЯчейках.НоваяНоменклатураИЛИХарактеристикаИЛИСерия, ИСТИНА) КАК НоваяНоменклатураИЛИХарактеристикаИЛИСерия,
	|	&ПоFEFOПараметр1,
	|	&ТекстПриоритетСтратегии КАК ПриоритетСтратегии,
	|	ЕСТЬNULL(ОстаткиВЯчейках.ЕстьНужноеНазначение, ЛОЖЬ) КАК ЕстьНужноеНазначение
	|ИЗ
	|	ПулЯчеек КАК ПулЯчеек
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиВЯчейках КАК ОстаткиВЯчейках
	|		ПО ПулЯчеек.Ячейка = ОстаткиВЯчейках.Ячейка
	|		,&ПоFEFOПараметр2
	|ГДЕ 
	|	&ТекстПриоритетСтратегии <> &НарушенаМонотоварность
	|	И НЕ ЕСТЬNULL(ОстаткиВЯчейках.ЯчейкаПодДругоеНазначение, ЛОЖЬ)
	|УПОРЯДОЧИТЬ ПО
	|	ПулЯчеек.СостояниеПересчета,
	|	ПулЯчеек.ПриоритетОбласти,
	|	ПриоритетСтратегии,
	|	&ПоFEFOПараметр3,
	|	УровеньДоступности,
	// Упорядочивание по свободному объему:
	// - по убыванию для ячеек из области обычного хранение;
	// В области обычного хранения такой сортировкой удается минимизировать количество ячеек в которые поместиться
	// размещаемый товар. - по возрастанию(по убыванию со знаком "минус") для ячеек из области обособленного хранения;
	// В области обособленного хранения такой сортировкой удается минимизировать общее количество ячеек/пространства
	// занимаемое под назначение.
	|	СвободныйОбъемПорядок УБЫВ,
	|	ПорядокОбхода,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПулЯчеек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиВЯчейках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиВЯчейкахБезКоличества";
	
	НарушенаМонотоварность = 10;//это число заведомо больше, чем приоритет любой стратегии
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстПриоритетСтратегии", ТекстПриоритетСтратегии);
	
	Если ЗначениеЗаполнено(ВыборкаПоСериям.Упаковка) Тогда
		
		#Удаление
		КоличествоДляВыборки = ?(Цел(КоличествоУпаковок) > 0,
		Окр(КоличествоУпаковок),
		1);   
		#КонецУдаления 
		
		#Вставка
		КоличествоДляВыборки = 25;
		#КонецВставки
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВыбратьПервые,",
		"ПЕРВЫЕ " + Формат(КоличествоДляВыборки,"ЧГ=")); //@query-part-2
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВыбратьПервые,", "");
	КонецЕсли;
	
	Если ПоFEFO Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоFEFOПараметр1,", "ЕСТЬNULL(МаксимальныеСрокиГодностиВЯчейках.ГоденДо, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ГоденДо,"); //@Query-part-2
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ",&ПоFEFOПараметр2", "		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеСрокиГодностиВЯчейках КАК МаксимальныеСрокиГодностиВЯчейках
		|		ПО (МаксимальныеСрокиГодностиВЯчейках.Номенклатура = &Номенклатура)
		|			И (МаксимальныеСрокиГодностиВЯчейках.Характеристика = &Характеристика)
		|			И ПулЯчеек.Ячейка = МаксимальныеСрокиГодностиВЯчейках.Ячейка"); //@Query-part-2
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоFEFOПараметр3,", "ГоденДо,");
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоFEFOПараметр1,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ",&ПоFEFOПараметр2", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоFEFOПараметр3,", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НарушенаМонотоварность",НарушенаМонотоварность);
	
	Запрос.УстановитьПараметр("СкладскаяГруппаНоменклатуры",ВыборкаПоСериям.СкладскаяГруппаНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура",ВыборкаПоСериям.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",ВыборкаПоСериям.Характеристика);
	Запрос.УстановитьПараметр("Назначение",ВыборкаПоСериям.Назначение);
	Запрос.УстановитьПараметр("Серия",ВыборкаПоСериям.Серия);
	Запрос.УстановитьПараметр("СкладскаяГруппаУпаковок",ВыборкаПоСериям.СкладскаяГруппаУпаковок);
	
	// Если упаковка не помещается по габаритам, то ячейка не нужна
	Запрос.УстановитьПараметр("Ширина",ВыборкаПоСериям.Ширина);
	Запрос.УстановитьПараметр("Глубина",ВыборкаПоСериям.Глубина);
	Запрос.УстановитьПараметр("Высота",ВыборкаПоСериям.Высота);
	
	// Если в ячейку по весу или по объему не помещается хотя бы одна упаковка, то ячейка не нужна.
	Если ЗначениеЗаполнено(ВыборкаПоСериям.Упаковка) Тогда
		Запрос.УстановитьПараметр("Вес",ВыборкаПоСериям.Вес);
		Запрос.УстановитьПараметр("Объем",ВыборкаПоСериям.Объем);
	Иначе
		Запрос.УстановитьПараметр("Вес",ВыборкаПоСериям.Вес/1000);
		Запрос.УстановитьПараметр("Объем",ВыборкаПоСериям.Объем/1000);
	КонецЕсли;
	Запрос.УстановитьПараметр("ОграничиватьПоВесу",ВыборкаПоСериям.ОграничиватьПоВесу);
	Запрос.УстановитьПараметр("ОграничиватьПоОбъему",ВыборкаПоСериям.ОграничиватьПоОбъему);
	
	// Безразмерные упаковки можно помещать только в неограниченные по размерам ячейки
	Запрос.УстановитьПараметр("Безразмерная",ВыборкаПоСериям.Безразмерная);
	
	ЗапросПакет = Запрос.ВыполнитьПакет(); 
	
	ВыборкаПоЯчейкам = ЗапросПакет[3].Выбрать();
	
	ОченьБольшоеЧисло = 99999999999;
	
	КоличествоКРазмещению = ВыборкаПоСериям.КоличествоУпаковок;
	
	Пока ВыборкаПоЯчейкам.Следующий()
		И КоличествоКРазмещению > 0 Цикл
		
		СтрокаНаполненности = СтруктураТаблиц.ТаблицаНаполненияЯчеек.Найти(ВыборкаПоЯчейкам.Ячейка, "Ячейка");
		
		Если СтрокаНаполненности = Неопределено Тогда
			// Добавим строку в таблицу наполненности, т.к. хотя бы одну упаковку мы в любом случае поместим.
			СтрокаНаполненности 				= СтруктураТаблиц.ТаблицаНаполненияЯчеек.Добавить();
			
			СтрокаНаполненности.Ячейка 			= ВыборкаПоЯчейкам.Ячейка;
			СтрокаНаполненности.Объем 			= 0;
			СтрокаНаполненности.Вес  			= 0;
			
			// Заполним назначение для ячеек из области обособленного хранения
			Если ВыборкаПоСериям.Назначение <> Справочники.Назначения.ПустаяСсылка() 
				И ВыборкаПоЯчейкам.ОбластьОбособленногоХранения Тогда
				СтрокаНаполненности.Назначение = ВыборкаПоСериям.Назначение;
			КонецЕсли;	
			
			РабочийУчасток = МассивУчастков.Найти(ВыборкаПоЯчейкам.РабочийУчасток);
			
			Если РабочийУчасток = Неопределено Тогда
				МассивУчастков.Добавить(ВыборкаПоЯчейкам.РабочийУчасток);
			КонецЕсли;
			
		КонецЕсли;
		
		#Вставка 
		
		Запись = РегистрыСведений.СБ_ВместимостьЯчеекПоТиповымУпаковкам.СоздатьМенеджерЗаписи();
		Запись.Ячейка= ВыборкаПоЯчейкам.Ячейка;
		Запись.Тара= ВыборкаПоСериям.Упаковка.Типоразмер;
		Запись.Прочитать();
		
		ЗаписьСуществует = Запись.Выбран();
		
		Если ВыборкаПоЯчейкам.Ячейка.Владелец.СБ_СкладНЗПИлиСкладСбыта И ЗаписьСуществует Тогда // Последние изменения последнее изменение 
			ВсегоПоместитсяВЯчейку = СБ_РасчетСкладскихЯчеек.СБ_РасчетВместимостиКоличестваТарВЯчейку(ВыборкаПоЯчейкам.Ячейка, ВыборкаПоСериям.Упаковка.Типоразмер, КоличествоКРазмещению); 
			
			Если ВсегоПоместитсяВЯчейку > 0 Тогда
				
				КоличествоВЯчейку = Мин(ВсегоПоместитсяВЯчейку,КоличествоКРазмещению);
				
				СтрокаРезультата = СтруктураТаблиц.ТаблицаРезультатов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультата,ВыборкаПоЯчейкам);
				ЗаполнитьЗначенияСвойств(СтрокаРезультата,ВыборкаПоСериям);
				СтрокаРезультата.КоличествоУпаковок 	= КоличествоВЯчейку;
				СтрокаРезультата.Количество			 	= КоличествоВЯчейку * ВыборкаПоСериям.КоличествоВУпаковке;
				//СтрокаРезультата.ОбъемУпаковки = ВыборкаПоСериям.Объем;
				//СтрокаРезультата.ВесУпаковки   = ВыборкаПоСериям.Вес;
				
				НоваяСтрокаТаблицыИспользуемыхЯчеек	= СтруктураТаблиц.ТаблицаРазмещенныхТоваров.Добавить();
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Ячейка 		   = ВыборкаПоЯчейкам.Ячейка;
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Номенклатура   = ВыборкаПоСериям.Номенклатура;
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Характеристика = ВыборкаПоСериям.Характеристика;
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Серия		   = ВыборкаПоСериям.Серия;
				
				//СтрокаНаполненности.Объем = СтрокаНаполненности.Объем + КоличествоВЯчейку*ВыборкаПоСериям.Объем;
				//СтрокаНаполненности.Вес   = СтрокаНаполненности.Вес + КоличествоВЯчейку*ВыборкаПоСериям.Вес;
				
				Если ВыборкаПоЯчейкам.НоваяНоменклатура Тогда
					СтрокаНаполненности.КоличествоНоменклатур = СтрокаНаполненности.КоличествоНоменклатур + 1;
				КонецЕсли;
				
				Если ВыборкаПоЯчейкам.НоваяНоменклатураИЛИХарактеристика Тогда
					СтрокаНаполненности.КоличествоХарактеристик = СтрокаНаполненности.КоличествоХарактеристик + 1;
				КонецЕсли;
				
				Если ВыборкаПоЯчейкам.НоваяНоменклатураИЛИХарактеристикаИЛИСерия Тогда
					СтрокаНаполненности.КоличествоСерий = СтрокаНаполненности.КоличествоСерий + 1;
				КонецЕсли;
				
				КоличествоКРазмещению = КоличествоКРазмещению - КоличествоВЯчейку;
				
				ВсегоПоместитсяВЯчейку = ВсегоПоместитсяВЯчейку - КоличествоВЯчейку;
				
			Иначе
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли ЗаписьСуществует Тогда 
			#КонецВставки
			
			Если ВыборкаПоЯчейкам.НеОграниченаПоРазмерам Или Не ВыборкаПоСериям.ОграничиватьПоОбъему Тогда
				ВсегоПоместитсяВЯчейкуПоОбъему = ОченьБольшоеЧисло;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаПоСериям.Упаковка) Тогда
				ВсегоПоместитсяВЯчейкуПоОбъему = Цел(ВыборкаПоЯчейкам.СвободныйОбъем/ВыборкаПоСериям.Объем);
			Иначе
				ВсегоПоместитсяВЯчейкуПоОбъему = Окр(ВыборкаПоЯчейкам.СвободныйОбъем/ВыборкаПоСериям.Объем,3,РежимОкругления.Окр15как10);
				Если КоличествоКРазмещению < ВсегоПоместитсяВЯчейкуПоОбъему + 0.001 Тогда
					ВсегоПоместитсяВЯчейкуПоОбъему = КоличествоКРазмещению;
				Иначе
					ВсегоПоместитсяВЯчейкуПоОбъему = Цел(ВыборкаПоЯчейкам.СвободныйОбъем/ВыборкаПоСериям.Объем);
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаПоЯчейкам.НеОграниченаПоГрузоподъемности Или Не ВыборкаПоСериям.ОграничиватьПоВесу Тогда
				ВсегоПоместитсяВЯчейкуПоВесу = ОченьБольшоеЧисло;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаПоСериям.Упаковка) Тогда
				ВсегоПоместитсяВЯчейкуПоВесу = Цел(ВыборкаПоЯчейкам.СвободныйВес/ВыборкаПоСериям.Вес);
			Иначе
				ВсегоПоместитсяВЯчейкуПоВесу = Окр(ВыборкаПоЯчейкам.СвободныйВес/ВыборкаПоСериям.Вес,3,РежимОкругления.Окр15как10);
				Если КоличествоКРазмещению < ВсегоПоместитсяВЯчейкуПоВесу + 0.001 Тогда
					ВсегоПоместитсяВЯчейкуПоВесу = КоличествоКРазмещению;
				Иначе
					ВсегоПоместитсяВЯчейкуПоВесу = Цел(ВыборкаПоЯчейкам.СвободныйВес/ВыборкаПоСериям.Вес);
				КонецЕсли;
			КонецЕсли;
			
			
			Если ВсегоПоместитсяВЯчейкуПоОбъему > 0
				И ВсегоПоместитсяВЯчейкуПоВесу > 0 Тогда
				
				КоличествоВЯчейку = Мин(ВсегоПоместитсяВЯчейкуПоОбъему,ВсегоПоместитсяВЯчейкуПоВесу,КоличествоКРазмещению);
				
				СтрокаРезультата = СтруктураТаблиц.ТаблицаРезультатов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультата,ВыборкаПоЯчейкам);
				ЗаполнитьЗначенияСвойств(СтрокаРезультата,ВыборкаПоСериям);
				СтрокаРезультата.КоличествоУпаковок 	= КоличествоВЯчейку;
				СтрокаРезультата.Количество			 	= КоличествоВЯчейку * ВыборкаПоСериям.КоличествоВУпаковке;
				СтрокаРезультата.ОбъемУпаковки = ВыборкаПоСериям.Объем;
				СтрокаРезультата.ВесУпаковки   = ВыборкаПоСериям.Вес;
				
				НоваяСтрокаТаблицыИспользуемыхЯчеек	= СтруктураТаблиц.ТаблицаРазмещенныхТоваров.Добавить();
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Ячейка 		   = ВыборкаПоЯчейкам.Ячейка;
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Номенклатура   = ВыборкаПоСериям.Номенклатура;
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Характеристика = ВыборкаПоСериям.Характеристика;
				НоваяСтрокаТаблицыИспользуемыхЯчеек.Серия		   = ВыборкаПоСериям.Серия;
				
				СтрокаНаполненности.Объем = СтрокаНаполненности.Объем + КоличествоВЯчейку*ВыборкаПоСериям.Объем;
				СтрокаНаполненности.Вес   = СтрокаНаполненности.Вес + КоличествоВЯчейку*ВыборкаПоСериям.Вес;
				
				Если ВыборкаПоЯчейкам.НоваяНоменклатура Тогда
					СтрокаНаполненности.КоличествоНоменклатур = СтрокаНаполненности.КоличествоНоменклатур + 1;
				КонецЕсли;
				
				Если ВыборкаПоЯчейкам.НоваяНоменклатураИЛИХарактеристика Тогда
					СтрокаНаполненности.КоличествоХарактеристик = СтрокаНаполненности.КоличествоХарактеристик + 1;
				КонецЕсли;
				
				Если ВыборкаПоЯчейкам.НоваяНоменклатураИЛИХарактеристикаИЛИСерия Тогда
					СтрокаНаполненности.КоличествоСерий = СтрокаНаполненности.КоличествоСерий + 1;
				КонецЕсли;
				
				КоличествоКРазмещению = КоличествоКРазмещению - КоличествоВЯчейку;
				
				ВсегоПоместитсяВЯчейкуПоОбъему = ВсегоПоместитсяВЯчейкуПоОбъему - КоличествоВЯчейку;
				ВсегоПоместитсяВЯчейкуПоВесу   = ВсегоПоместитсяВЯчейкуПоВесу - КоличествоВЯчейку;
				
			КонецЕсли; 		
			
			#Вставка
		КонецЕсли;
		#КонецВставки
		
	КонецЦикла;
	
	Если КоличествоКРазмещению > 0 Тогда
		СтрокаОшибки = СтруктураТаблиц.ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОшибки,ВыборкаПоСериям);
		СтрокаОшибки.КоличествоУпаковок = КоличествоКРазмещению;
		СтрокаОшибки.Количество			= КоличествоКРазмещению * ВыборкаПоСериям.КоличествоВУпаковке;
	КонецЕсли;
	
	ОбновитьВременныеТаблицы(МенеджерВременныхТаблиц, СтруктураТаблиц.ТаблицаНаполненияЯчеек, СтруктураТаблиц.ТаблицаРазмещенныхТоваров);
	
КонецПроцедуры
